---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireSizeSetIterator
source: html/358e6e15-6854-6fcd-43a3-8861bbb76178.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSetIterator

An iterator to a wire size set.

## Syntax (C#)
```csharp
public abstract class WireSizeSetIterator : APIObject,
	IEnumerator
```